In [1]:
import numpy as np
import pandas as pd

In [2]:
lower = {'A':'a', 'B':'b', 'C':'c', 'D':'d', 'E':'e'} #create dictionary
lower_ser = pd.Series(lower) #make into Series

numbers = {'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E':5}
numbers_ser = pd.Series(numbers)

In [6]:
q1 = pd.DataFrame({'lowercase': lower_ser, #combine series into DF
                   'numbers': numbers_ser})
q1

  lowercase  numbers
A         a        1
B         b        2
C         c        3
D         d        4
E         e        5

In [9]:
Q1 = q1.loc['C', 'numbers']
Q1

3

In [10]:
Q2 = q1.loc['B':, :]
Q2

  lowercase  numbers
B         b        2
C         c        3
D         d        4
E         e        5

In [11]:
Q3 = q1.loc['D']
Q3

lowercase    d
numbers      4
Name: D, dtype: object

In [12]:
Q4 = q1.loc['A':'C', 'numbers']
Q4

A    1
B    2
C    3
Name: numbers, dtype: int64

In [16]:
Q5 = q1.loc[['A','C','D'], :]
Q5

  lowercase  numbers
A         a        1
C         c        3
D         d        4

In [17]:
Q6 = q1.loc['C']
Q6

lowercase    c
numbers      3
Name: C, dtype: object

In [18]:
Q7 = q1.loc['E', 'numbers']
Q7

5

In [19]:
Q8 = q1.loc[['C','D','E'], :]
Q8

  lowercase  numbers
C         c        3
D         d        4
E         e        5

In [20]:
Q9 = q1.loc[q1['numbers']<3]
Q9

  lowercase  numbers
A         a        1
B         b        2

In [21]:
Q10 = q1.iloc[3]
Q10

lowercase    d
numbers      4
Name: D, dtype: object

In [22]:
Q11 = q1.iloc[4, 1]
Q11

5

In [24]:
Q12 = q1.iloc[[0, 2, 3], :]
Q12

  lowercase  numbers
A         a        1
C         c        3
D         d        4

In [25]:
Q13 = q1.iloc[2:, :]
Q13

  lowercase  numbers
C         c        3
D         d        4
E         e        5

In [26]:
Q14 = q1.lowercase
Q14

A    a
B    b
C    c
D    d
E    e
Name: lowercase, dtype: object

In [28]:
lower = {'A':'a', 'B':'b', 'C':'c', 'D':'d', 'E':'e'} #create dictionary
numbers = {'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E':5}
lower_ser = pd.Series(lower) #make into Series
numbers_ser = pd.Series(numbers)
Q15 = pd.DataFrame({'lowercase': lower_ser, #combine series into DF
                   'numbers': numbers_ser})

  lowercase  numbers
A         a        1
B         b        2
C         c        3
D         d        4
E         e        5

In [32]:
Q15['percent'] = Q15['numbers']/Q15['numbers'].sum()
Q15

  lowercase  numbers   percent
A         a        1  0.066667
B         b        2  0.133333
C         c        3  0.200000
D         d        4  0.266667
E         e        5  0.333333